IDENTIFICATION DIVISION.
PROGRAM-ID. GCB_LECTURE.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT GCBComptesFile 
        FILE STATUS IS WS-FILE-STATUS
        ASSIGN TO "GCBComptesFile.txt".

DATA DIVISION.
FILE SECTION.
   FD GCBComptesFile.
   01 ComptesRecord.
      05 SoldeCompteFile PIC ZZZZ9.99 VALUE 0.

WORKING-STORAGE SECTION.
   01 WS-FILE-STATUS PIC 99.

LINKAGE SECTION.
   01 SoldeCompte PIC S9(5)V99.

PROCEDURE DIVISION USING SoldeCompte.
   IF WS-FILE-STATUS = 35
      CLOSE GCBComptesFile
      OPEN OUTPUT GCBComptesFile
   END-IF.
   OPEN I-O GCBComptesFile.
   READ GCBComptesFile NEXT RECORD 
      AT END MOVE 1000 TO SoldeCompte
      NOT AT END MOVE SoldeCompteFile TO SoldeCompte
   END-READ.
   CLOSE GCBComptesFile.
   EXIT PROGRAM.
   